src/Documents/ВъездНаПарковку/ВъездНаПарковку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВъездНаПарковку</name>
  <registerRecords>AccumulationRegister.ЗанятостьМест</registerRecords>
  <attributes>
    <name>Авто</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Территория</name>
    <type>
      <types>CatalogRef.Территория</types>
    </type>
  </attributes>
  <attributes>
    <name>НачальныйПериод</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Место</name>
    <type>
      <types>CatalogRef.Места</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Фото</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КонечныйПериод</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарковочнаяПлощадка</name>
    <type>
      <types>CatalogRef.Площадка</types>
    </type>
  </attributes>
</mdclass:Document>

src/AccumulationRegisters/ЗанятостьМест/ЗанятостьМест.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗанятостьМест</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаВъезда</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Территория</name>
    <type>
      <types>CatalogRef.Территория</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Площадка</name>
    <type>
      <types>CatalogRef.Площадка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Место</name>
    <type>
      <types>CatalogRef.Места</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/ВъездНаПарковку/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ЗанятостьМест Приход
	Движения.ЗанятостьМест.Записывать = Истина;
	Движение = Движения.ЗанятостьМест.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Территория = Территория;
	Движение.Площадка = ПарковочнаяПлощадка;
	Движение.Место = Место;
	Движение.Контрагент = Контрагент;
	Движение.ТранспортноеСредство = ТранспортноеСредство;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения);
	
КонецПроцедуры
